# It's time for Pandas
## This notebook explains.....

### install libraries

In [ ]:
#pip install pandas
#pip install numpy

* import libraries

In [2]:
import pandas as pd
import numpy as np

In [4]:
#object creation
s=pd.Series([1,3,2,np.nan,4,6,7])
s

0    1.0
1    3.0
2    2.0
3    NaN
4    4.0
5    6.0
6    7.0
dtype: float64

In [8]:
#dates between given interval
dates=pd.date_range("20230816", periods=6)
dates

DatetimeIndex(['2023-08-16', '2023-08-17', '2023-08-18', '2023-08-19',
               '2023-08-20', '2023-08-21'],
              dtype='datetime64[ns]', freq='D')

In [21]:
dates = pd.date_range("20230816", periods=6)
dates
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2023-08-16  0.657589  0.517322 -0.307899  0.673175
2023-08-17 -0.560103 -0.189405 -0.453486  0.052814
2023-08-18  1.253262  0.854895  0.315682 -0.413865
2023-08-19  0.035330  0.075179 -0.249996  0.461292
2023-08-20 -1.181973 -1.571237  1.728450  0.092886
2023-08-21 -0.409406 -0.278518  0.807918 -0.496321

In [7]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.
 
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df2 = pd.DataFrame(data)
 
# Print the output.
print(df2)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [8]:
df2.dtypes

Name    object
Age      int64
dtype: object

In [9]:
#printing top few rows
df2.head(2)

   Name  Age
0   Tom   20
1  nick   21

In [11]:
#printing last few rows
df2.tail(2)

    Name  Age
2  krish   19
3   jack   18

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df2.to_numpy()

array([['Tom', 20],
       ['nick', 21],
       ['krish', 19],
       ['jack', 18]], dtype=object)

In [14]:
df2.describe()

             Age
count   4.000000
mean   19.500000
std     1.290994
min    18.000000
25%    18.750000
50%    19.500000
75%    20.250000
max    21.000000

In [15]:
#transpose data
df2.T

        0     1      2     3
Name  Tom  nick  krish  jack
Age    20    21     19    18

In [22]:
#sorting data
df2.sort_index(axis=1,ascending=True)

   Age   Name
0   20    Tom
1   21   nick
2   19  krish
3   18   jack

In [24]:
#sorting by particular colomn
df2.sort_values(by="Age",ascending=True)

    Name  Age
3   jack   18
2  krish   19
0    Tom   20
1   nick   21

In [25]:
#particular column for selection and filteration
df2["Age"]

0    20
1    21
2    19
3    18
Name: Age, dtype: int64

In [27]:
#particular column for selection and filteration
df2["Name"]

0      Tom
1     nick
2    krish
3     jack
Name: Name, dtype: object

In [29]:
# sorting by index
#row wise selection
df2[0:2]

   Name  Age
0   Tom   20
1  nick   21

In [34]:
df2.loc[:,["Name"]]

    Name
0    Tom
1   nick
2  krish
3   jack

In [35]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.
 
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack','meena','sheena','shalu'],
        'Age':[20, 21, 19, 18,23,45,67],'Gender':['m','m','m','m','f','f','f']}
 
# Create DataFrame
df2 = pd.DataFrame(data)
 
# Print the output.
print(df2)

     Name  Age Gender
0     Tom   20      m
1    nick   21      m
2   krish   19      m
3    jack   18      m
4   meena   23      f
5  sheena   45      f
6   shalu   67      f

In [36]:
#selecting particular data
df2.loc[0:5,["Name","Age"]]

     Name  Age
0     Tom   20
1    nick   21
2   krish   19
3    jack   18
4   meena   23
5  sheena   45

In [37]:
#selecting particular data
df2.loc[[0,5],["Name","Age"]]

     Name  Age
0     Tom   20
5  sheena   45

In [39]:
#different dimension data
df2.loc[[3],["Name","Age","Gender"]]

   Name  Age Gender
3  jack   18      m

In [40]:
df2.iloc[2]

Name      krish
Age          19
Gender        m
Name: 2, dtype: object

In [42]:
#data whose age is greater then 20
df2[df2["Age"]>20]

     Name  Age Gender
1    nick   21      m
4   meena   23      f
5  sheena   45      f
6   shalu   67      f

In [49]:
#is in method adding column to data set
df=df2.copy()
df["Qualification"]=["MCA","B.SC","LAWYER","HOTEL MANAGEMENT","DOCTOR","ENGINEER","PILOT"]
df

     Name  Age Gender     Qualification
0     Tom   20      m               MCA
1    nick   21      m              B.SC
2   krish   19      m            LAWYER
3    jack   18      m  HOTEL MANAGEMENT
4   meena   23      f            DOCTOR
5  sheena   45      f          ENGINEER
6   shalu   67      f             PILOT

In [3]:
#basic statistic or summary
kashti.describe()